# Data Titanic

#### Yang dikerjakan :
- Mengolah dataframe Titanic
    - Mengolah informasi yang terdapat pada dataframe titanic.

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [11]:
import seaborn as sns

#### Load Data Titanic

In [5]:
df = sns.load_dataset('titanic')

In [12]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

#### Informasi DataFrame Titanic secara keseluruhan

Terdapat 15 Kolom pada DataFrame Titanic, yaitu:
- Survived = {1 = Selamat, 0 = Meninggal}
- pclass = Tiket Class {1 = 1st, 2 = 2st, 3 = 3rd} (Dalam bentuk angka)
- sex = Jenis Kelamin {male, female}
- age = umur (dalam tahun)
- sibsp = kakak adik / pasangan yg ikut naik kapal titanic 
- parch = orang tua / anak yg ikut naik kapal titanic
- fare = Tarif (dalam bentuk dollar)
- embarked = Titik embarkasi {C= Cherbourg, Q = Queenstown, S=Southampton}
- class = Tiket Class {first, second, third} (Dalam bentuk kata) 
- who = {man, woman, child}
- adult_male = Orang Dewasa {True, False}
- deck = Nomor Kabin / Deck {A,B,C,D,E,F,G}
- embark_town = Kota Embarkasi {Cherbourg, Queenstown, Southampton}
- alive = Kondisi Selamat {no = Meninggal, yes= selamat} 
- alone = {True = Sendiri, False = Bersama keluarga/saudara}

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

Dari df.info(), diketahui terdapat beberapa missing value, yaitu pada:
 - Kolom Umur Penumpang ('age')
 - Kolom titik awal naik penumpang ('embarked') & ('embarked_town')
 - Kolom Nomor Kabin/Deck ('deck')

----

## A. Rata-rata umur penumpang

In [172]:
## Mengihitung umur rata-rata penumpang
rUmurPenumpang = round(df['age'].mean(),2)
print(f"Rata-rata umur penumpang : {rUmurPenumpang} Tahun\n")

## Rata-rata umur penumpang yang selamat
rUmurPenumpangSelamat = round(df[df['survived']==1]['age'].agg('mean'),2)
print(f"Rata-rata umur penumpang yang selamat : {rUmurPenumpangSelamat} Tahun\n")

## Rata-rata umur penumpang yang meninggal
rUmurPenumpangMnggl = round(df[df['survived']==0]['age'].describe()['mean'],2)
print(f"Rata-rata umur penumpang yang meninggal : {rUmurPenumpangMnggl} Tahun\n")

## Rata-rata umur penumpang pria
rUmurPria = round(df[df['sex']=='male']['age'].mean(),2)
print(f"Rata-rata umur penumpang pria : {rUmurPria} Tahun\n")

## Rata-rata umur penumpang pria
rUmurPerempuan = round(df[df['sex']=='female']['age'].agg('mean'),2)
print(f"Rata-rata umur penumpang wanita : {rUmurPerempuan} Tahun")

Rata-rata umur penumpang : 29.7 Tahun

Rata-rata umur penumpang yang selamat : 28.34 Tahun

Rata-rata umur penumpang yang meninggal : 30.63 Tahun

Rata-rata umur penumpang pria : 30.73 Tahun

Rata-rata umur penumpang wanita : 27.92 Tahun

## B. Jumlah Penumpang

In [146]:
## Jumlah penumpang
jmlPenumpang =len(df)
print(f"Jumlah penumpang : {jmlPenumpang} orang\n")

## Jumlah Penumpang yang selamat
jmlSelamat = len(df[df['survived']== 1])
print(f"Jumlah penumpang selamat : {jmlSelamat} orang\n")

## Jumlah Penumpang yang meninggal
jmlMeninggal = len(df[df['survived']== 0])
print(f"Jumlah penumpang meninggal : {jmlMeninggal} orang")

Jumlah penumpang : 891 orang

Jumlah penumpang selamat : 342 orang

Jumlah penumpang meninggal : 549 orang

-----------

## C. Klasifikasi Penumpang

### - Berdasarkan Jenis Kelamin
#### Jumlah penumpang laki-laki

In [182]:
## Menghitung jumlah penumpang laki-laki
jmlPenumpangL =len(df[df['sex'] == 'male'])
print(f"Jumlah penumpang laki-laki : {jmlPenumpangL} orang\n")

## Menghitung jumlah penumpang laki-laki yang selamat
jmlLakiSlmt = len(df[(df['sex']=='male')& (df['survived']==1)])
print(f"Jumlah penumpang laki-laki selamat : {jmlLakiSlmt} orang\n")

##Menghitung jumlah penumpang laki laki yng meninggal
jmlLakiMnggl = len(df[(df['sex'] == 'male') & (df['survived']== 0)])
print(f"Jumlah penumpang laki-laki meninggal : {jmlLakiMnggl} orang")

Jumlah penumpang laki-laki : 577 orang

Jumlah penumpang laki-laki selamat : 109 orang

Jumlah penumpang laki-laki meninggal : 468 orang

####  Jumlah penumpang perempuan

In [183]:
## Menghitung jumlah penumpang perempuan
jmlPenumpangP = len(df[df['sex']== 'female'])
print(f"Jumlah penumpang perempuan : {jmlPenumpangP} orang\n")

## Menghitung jumlah penumpang perempuan yang selamat
jmlPerempuanSlmt = len(df[(df['sex']=='female')& (df['survived']==1)])
print(f"Jumlah penumpang perempuan selamat : {jmlPerempuanSlmt} orang\n")

##Menghitung jumlah penumpang perempuan yng meninggal
jmlPerempuanMnggl = len(df[(df['sex'] == 'female') & (df['survived']== 0)])
print(f"Jumlah penumpang perempuan meninggal : {jmlPerempuanMnggl} orang")

Jumlah penumpang perempuan : 314 orang

Jumlah penumpang perempuan selamat : 233 orang

Jumlah penumpang perempuan meninggal : 81 orang

------

### - Berdasarkan Umur
#### Jumlah Penumpang Balita (0 - 4 Tahun)

In [194]:
## Menghitung jumlah penumpang balita
jmlPenumpangBalita =len(df[(df['age'] >= 0) & (df['age'] < 5)])
print(f"Jumlah penumpang balita : {jmlPenumpangBalita} orang\n")

## Menghitung jumlah balita yang selamat
jmlBalitaSlmt =len(df[(df['age'] >= 0) & (df['age'] < 5) & (df['survived']==1)])
print(f"Jumlah penumpang balita selamat : {jmlBalitaSlmt} orang\n")

## Menghitung jumlah balita yang meninggal
jmlBalitaMnggl =len(df[(df['age'] >= 0) & (df['age'] < 5) & (df['survived']==0)])
print(f"Jumlah penumpang balita meninggal : {jmlBalitaMnggl} orang")

Jumlah penumpang balita : 40 orang

Jumlah penumpang balita selamat : 27 orang

Jumlah penumpang balita meninggal : 13 orang

#### Jumlah penumpang kanak-kanak (5 - 11 Tahun)

In [185]:
## Menghitung jumlah penumpang kanak-kanak
jmlPenumpangKanak2 = len(df[(df['age'] >= 5) & (df['age'] < 12)])
print(f"Jumlah penumpang kanak-kanak : {jmlPenumpangKanak2} orang\n")

Jumlah penumpang kanak-kanak : 28 orang

#### Jumlah penumpang remaja (12 - 25 Tahun)

In [187]:
## Menghitung jumlah penumpang remaja
jmlPenumpangRemaja = len(df[(df['age'] >= 12) & (df['age'] < 26) ])
print(f"Jumlah penumpang remaja : {jmlPenumpangRemaja} orang\n")

Jumlah penumpang remaja : 233 orang

#### Jumlah penumpang dewasa (26 - 45 Tahun)

In [188]:
## Menghitung jumlah penumpang dewasa
jmlPenumpangDewasa = len(df[(df['age']>= 26) & (df['age'] < 46) ])
print(f"Jumlah penumpang dewasa : {jmlPenumpangDewasa} orang\n")

Jumlah penumpang dewasa : 312 orang

#### Jumlah penumpang lansia ( Diatas 46 Tahun)

In [91]:
## Menghitung jumlah penumpang lansia

In [189]:
jmlPenumpangLansia = len(df[df['age'] >= 46])
print(f"Jumlah penumpang lansia : {jmlPenumpangLansia} orang\n")

Jumlah penumpang lansia : 101 orang

In [190]:
jmlPenumpangBalita +jmlPenumpangDewasa + jmlPenumpangKanak2 + jmlPenumpangRemaja + jmlPenumpangLansia

714

---

### - Berdasarkan Kelas
#### Jumlah penumpang kelas 1

#### Jumlah penumpang kelas 2

#### Jumlah penumpang kelas 3

In [195]:
df['who'].uniqueque()

array(['man', 'woman', 'child'], dtype=object)